In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
#import seaborn as sns
%matplotlib inline

In [2]:
df = pd.read_csv('C:\\Users\\arif\\OneDrive\\Journal Paper\\Code\\Irshad\\Dataset\\4_fill_consectives_missing.csv', parse_dates=['date_and_hour'], index_col='date_and_hour')

In [3]:
df

                     System_load
date_and_hour
2015-01-01 00:00:00       8288.0
2015-01-01 01:00:00       8099.0
2015-01-01 02:00:00       7994.0
2015-01-01 03:00:00       7965.0
2015-01-01 04:00:00       8120.0
...                          ...
2020-04-30 19:00:00      16858.0
2020-04-30 20:00:00      17105.0
2020-04-30 21:00:00      16824.0
2020-04-30 22:00:00      16332.0
2020-04-30 23:00:00      15003.0

[46728 rows x 1 columns]

In [4]:
df['System_load'].interpolate(method='time',inplace=True)

In [5]:
# will fill the remaing by interpolation
df.isnull().sum()

System_load    0
dtype: int64

In [6]:
df.reset_index(inplace=True)

In [7]:
df

            date_and_hour  System_load
0     2015-01-01 00:00:00       8288.0
1     2015-01-01 01:00:00       8099.0
2     2015-01-01 02:00:00       7994.0
3     2015-01-01 03:00:00       7965.0
4     2015-01-01 04:00:00       8120.0
...                   ...          ...
46723 2020-04-30 19:00:00      16858.0
46724 2020-04-30 20:00:00      17105.0
46725 2020-04-30 21:00:00      16824.0
46726 2020-04-30 22:00:00      16332.0
46727 2020-04-30 23:00:00      15003.0

[46728 rows x 2 columns]

In [8]:
df.to_csv('C:\\Users\\arif\\OneDrive\\Journal Paper\\Code\\Irshad\\Dataset\\5_All_Values_handaled.csv',index=False)

In [9]:
df = pd.read_csv('C:\\Users\\arif\\OneDrive\\Journal Paper\\Code\\Irshad\\Dataset\\5_All_Values_handaled.csv', parse_dates=['date_and_hour'], index_col='date_and_hour')

In [10]:
# will fill the remaing by interpolation
df.isnull().sum()

System_load    0
dtype: int64